Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Other JDBC extensions, such as link:https://github.com/quarkiverse/quarkus-jdbc-sqlite[SQLite] and its link:https://docs.quarkiverse.io/quarkus-jdbc-sqlite/dev/index.html[documentation], can be found in the https://github.com/quarkiverse[Quarkiverse].
ja_jp: その他のJDBCエクステンション (link:https://github.com/quarkiverse/quarkus-jdbc-sqlite[SQLite] およびその link:https://docs.quarkiverse.io/quarkus-jdbc-sqlite/dev/index.html[ドキュメント]など) は、 https://github.com/quarkiverse[Quarkiverse] にあります。

source: Other JDBC extensions, such as link:https://github.com/quarkiverse/quarkus-jdbc-sqlite[SQLite] and its link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-jdbc-sqlite/dev/index.html[documentation], can be found in the https://github.com/quarkiverse[Quarkiverse].
ja_jp: その他のJDBCエクステンション、 link:https://github.com/quarkiverse/quarkus-jdbc-sqlite[SQLite] や、その link:https://quarkiverse.github.io/quarkiverse-docs/quarkus-jdbc-sqlite/dev/index.html[ドキュメント] などは link:https://github.com/quarkiverse[Quarkiverse] にあります。

source: Other Linux settings
ja_jp: その他のLinux設定

source: Other Quarkus Guides
ja_jp: その他のQuarkusガイド

source: Other Quarkus extensions that consume the Mongo Client may cause application startup to fail.
ja_jp: Mongo クライアントを使用する他の Quarkus エクステンションが、アプリケーションの起動に失敗する原因となる可能性があります。

source: Other Quarkus extensions that consume the Redis Client may cause application startup to fail.
ja_jp: Redis クライアントを消費する他の Quarkus エクステンションにより、アプリケーションの起動が失敗する可能性があります。

source: Other Quarkus extensions that consume the datasource may cause application startup to fail.
ja_jp: データソースを消費する他のQuarkusエクステンションによって、アプリケーションの起動が失敗する可能性があります。

source: Other Quarkus extensions that consume the persistence unit may cause application startup to fail.
ja_jp: 永続化ユニットを消費する他の Quarkus エクステンションが、アプリケーションの起動を失敗させる可能性があります。

source: Other Swagger UI Options
ja_jp: その他のスワガーUIオプション

source: Other applicable authentication mechanisms performed authentication and are available on the `SecurityIdentity`.
ja_jp: その他の該当する認証メカニズムは認証を実行し、 `SecurityIdentity` で利用できます。

source: Other authentication mechanisms, such as SCRAM and GSSAPI, are not yet verified with the Infinispan client.
ja_jp: SCRAMやGSSAPIなどの他の認証メカニズムは、Infinispanクライアントではまだ検証されていません。

source: Other base images might provide launch scripts that enable debugging when an environment variable is set, in which case you would set than environment variable when launching the container.
ja_jp: 他のベースイメージでは、環境変数の設定によりデバッグが可能になる起動スクリプトが提供されている場合があり、その場合はコンテナの起動時に環境変数を設定します。

source: Other base images might provide launch scripts that enable debugging when an environment variable is set, in which case you would set that environment variable when launching the container.
ja_jp: 他のベースイメージでは、環境変数の設定によってデバッグが可能になる起動スクリプトが提供されている場合があります。その場合は、コンテナーの起動時にその環境変数を設定します。

source: Other changes
ja_jp: その他変更点

source: Other common document header attributes
ja_jp: その他の共通ドキュメントヘッダー属性

source: Other configuration needs have been automated: Quarkus will make some opinionated choices and educated guesses.
ja_jp: その他の設定の必要性は自動化されています。Quarkusは、いくつかの定見に基づいた選択と経験に基づいた推測を行います。

source: Other configuration options are described below, although they should typically be left untouched.
ja_jp: その他の設定オプションについては以下に説明しますが、通常は変更しないでください。

source: Other configuration overrides may be included in the same map.
ja_jp: 他の設定のオーバーライドも同じマップに含めることができます。

source: Other connectors, such as the *JMS Connector* or the *Google PubSub Connector*, do not benefit from the same level of integration and require more manual configuration to set up.
ja_jp: *JMS Connector* や *Google PubSub Connector* などの他のコネクターでは、同じレベルのインテグレーションのメリットが得られず、セットアップには手動での設定がさらに必要となります。

source: Other databases
ja_jp: その他のデータベース

source: Other dev mode features like `https://localhost:8080/q/dev` and `https://localhost:8080/q/swagger-ui` are also available.
ja_jp: 他にも `https://localhost:8080/q/dev` や `https://localhost:8080/q/swagger-ui` のような開発モードの機能が用意されています。

source: Other events
ja_jp: その他のイベント

source: Other formats are also accepted, but are only useful for advanced use cases. See link:{hibernate-search-doc-prefix}#configuration-bean-reference-parsing[this section of Hibernate Search's reference documentation] for more information.
ja_jp: 他の形式も認められていますが、高度なユースケースでのみ有用です。詳細については、 link:{hibernate-search-doc-prefix}#configuration-bean-reference-parsing[Hibernate Searchのリファレンスドキュメントのこのセクション] を参照してください。

source: Other formats are also accepted, but are only useful for advanced use cases. See link:{hibernate-search-docs-url}#configuration-bean-reference-parsing[this section of Hibernate Search's reference documentation] for more information.
ja_jp: 他の形式も認められていますが、高度なユースケースでのみ有用です。 詳細は、link:{hibernate-search-docs-url}#configuration-bean-reference-parsing[Hibernate Searchの参照ドキュメントのこちらのセクション] を参照してください。

source: Other grants
ja_jp: その他のグラント

source: Other https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.Type.html[LRA.Type element values] may be useful, depending upon what your application is trying to achieve. For those readers familiar with JTA it is worth remarking that it was loosely modelled on the https://docs.oracle.com/javaee/7/api/javax/transaction/Transactional.TxType.html[Java Transactional TxType annotation].
ja_jp: アプリケーションの目的に応じて、他の https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ws/rs/LRA.Type.html[LRA.Type の値]も有効です。JTAに慣れた読者は、LRA.Typeは https://docs.oracle.com/javaee/7/api/javax/transaction/Transactional.TxType.html[Java Transactional TxType アノテーション]をおおまかにモデルにして開発されたことを知っておくと良いでしょう。

source: Other interceptors could be provided to log method invocations to different targets.
ja_jp: 他にも、異なるターゲットへのメソッド呼び出しをログに記録するためのインターセプターを提供することができます。

source: Other notable differences
ja_jp: その他の特記すべき相違点

source: Other notable features
ja_jp: その他の注目すべき機能

source: Other parameter types mentioned in the Spring `https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/web/bind/annotation/ExceptionHandler.html[ExceptionHandler javadoc]` are not supported.
ja_jp: Spring `https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/web/bind/annotation/ExceptionHandler.html[ExceptionHandler javadoc]` に記載されているその他のパラメーターの型はサポートされていません。

source: Other patterns
ja_jp: その他のパターン

source: Other platforms
ja_jp: その他のプラットフォーム

source: Other properties
ja_jp: その他のプロパティー

source: Other registry implementations
ja_jp: その他のレジストリ実装

source: Other resources files can be registered to be included in the native image by using `@RegisterResources`:
ja_jp: その他のリソースファイルは、 `@RegisterResources` を使って、ネイティブイメージに含まれるように登録することができます：

source: Other resources should be declared explicitly.
ja_jp: その他のリソースは明示的に宣言する必要があります。

source: Other return types mentioned in the Spring `https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/web/bind/annotation/ExceptionHandler.html[ExceptionHandler javadoc]` are not supported.
ja_jp: Spring `https://docs.spring.io/spring-framework/docs/current/javadoc-api/org/springframework/web/bind/annotation/ExceptionHandler.html[ExceptionHandler javadoc]` に記載されているその他の戻り値型はサポートされていません。

source: Other small new features
ja_jp: その他の小さな新機能

source: Other styling options
ja_jp: その他のスタイリングオプション

source: Other supported authentication mechanisms
ja_jp: その他のサポートされる認証メカニズム

source: Other than method signatures returning a Reactive Stream `Publisher` (`Multi` being an implementation of `Publisher`), outgoing method can also return single message. In this case the producer will use this method as generator to create an infinite stream.
ja_jp: Reactive Stream `Publisher` (`Multi` が `Publisher` の実装) を返すメソッドシグネチャー以外に、送信メソッドは単一のメッセージを返すこともできます。この場合、プロデューサーはこのメソッドをジェネレーターとして使用して、無限のストリームを作成します。

source: Other than method signatures returning a `Flow.Publisher`, outgoing method can also return single message. In this case the producer will use this method as generator to create an infinite stream.
ja_jp: 発信メソッドは、 `Flow.Publisher` を返すメソッドシグネチャーの他に、単一のメッセージを返すこともできます。 この場合、プロデューサーがこのメソッドをジェネレーターとして使用して無限のストリームを作成します。

source: Other topics
ja_jp: その他のトピック

source: Other types may be supported for injection, please see other sections for more information
ja_jp: その他の型は注入のためにサポートされている場合がありますが、詳細については他のセクションを参照してください

source: Other ways
ja_jp: 他の方法

source: Other ways to create pages
ja_jp: ページを作成するその他の方法

source: Others
ja_jp: その他

source: Others ...
ja_jp: その他...

source: Otherwise, Dev Services will default to Elasticsearch. To use OpenSearch, configure the distribution explicitly:
ja_jp: そうでない場合、Dev ServicesはデフォルトでElasticsearchを使用します。OpenSearchを使用するには、ディストリビューションを明示的に設定してください：

source: Otherwise, a random key is generated, which can be problematic if the Quarkus application is running in the cloud with multiple pods managing the requests.
ja_jp: これ以外の場合は、ランダムなキーが生成されますが、Quarkus アプリケーションがクラウドで実行され、複数の Pod がリクエストを管理している場合、問題が発生する可能性があります。

source: Otherwise, both operands are coerced to `java.math.BigDecimal` first and then the `BigDecimal#compareTo(BigDecimal)` method is used to perform comparison.
ja_jp: それ以外の場合は、まず両方のオペランドが `java.math.BigDecimal` に強制変換され、次に `BigDecimal#compareTo (BigDecimal)` メソッドを使用して比較が実行されます。

source: Otherwise, if a Credentials Provider is configured, the credentials are retrieved from the provider.
ja_jp: それ以外の場合、クレデンシャルプロバイダーが設定されている場合は、プロバイダーからクレデンシャルが取得されます。

source: Otherwise, if both operands are not `null` and at least one of them is an instance of `java.lang.Number`, then operands are coerced to `java.math.BigDecimal` and the `BigDecimal#compareTo(BigDecimal)` method is used to perform comparison.
ja_jp: それ以外の場合、両方のオペランドが `null` ではなく、少なくとも 1 つが `java.lang.Number` のインスタンスである場合、オペランドは `java.math.BigDecimal` に強制変換され、`BigDecimal#compareTo (BigDecimal)` メソッドを使用して比較が実行されます。

source: Otherwise, if the method has exactly one argument, then that argument is the cache key.
ja_jp: このメソッドが正確に1つの引数を持つ場合、この引数はキャッシュキーとなります。

source: Otherwise, if the method has multiple arguments and none of them are annotated with `@CacheKey`, the cache key is an instance of `io.quarkus.cache.CompositeCacheKey` built from all the method arguments.
ja_jp: メソッドが複数の引数を持ち、そのどれにも `@CacheKey` でアノテーションされていない場合、キャッシュキーはすべてのメソッド引数から構築される `io.quarkus.cache.CompositeCacheKey` のインスタンスになります。

source: Otherwise, if the method has multiple arguments annotated with `@CacheKey`, then the cache key is an instance of `io.quarkus.cache.CompositeCacheKey` built from these annotated arguments.
ja_jp: メソッドが `@CacheKey` でアノテーションされた複数の引数を持つ場合、キャッシュキーはこれらのアノテーションされた引数から構築される `io.quarkus.cache.CompositeCacheKey` のインスタンスになります。

source: Otherwise, if the method has multiple arguments but only one annotated with `@CacheKey`, then that annotated argument is the cache key.
ja_jp: メソッドに複数の引数があり、 `@CacheKey` でアノテーションされたものが１つだけある場合、このアノテーションされた引数がキャッシュキーとなります。

source: Otherwise, if the method has no arguments, then the cache key is an instance of `io.quarkus.cache.DefaultCacheKey` built from the cache name.
ja_jp: このメソッドに引数がなければ、キャッシュキーはキャッシュ名から作成される `io.quarkus.cache.DefaultCacheKey` のインスタンスとなります。

source: Otherwise, just replace `@HQL` with `@Query` and change the package import of `@Find`, and you can even write `@Delete` finder methods:
ja_jp: そうでない場合は、`@HQL` を `@Query` に置き換え、`@Find` のパッケージインポートを変更するだけで、`@Delete` ファインダーメソッドを作成することもできます。

source: Otherwise, the default name `quarkus-devservices-<application-name>` is chosen.
ja_jp: それ以外の場合、デフォルト名 `quarkus-devservices-<application-name>` が選択されます。

source: Otherwise, the paths `$JAVA_HOME/lib/security/jssecacerts` and `$JAVA_HOME/lib/security/cacerts` are checked, and the first existing file is used as a truststore.
ja_jp: それ以外の場合は、`$JAVA_HOME/lib/security/jssecacerts` and `$JAVA_HOME/lib/security/cacerts` のパスがチェックされ、最初の既存のファイルがトラストストアとして使用されます。

source: Otherwise, the service will send a redirect:
ja_jp: そうでない場合は、サービスはリダイレクトを送信します:

source: Otherwise, you can manually add the dependency to your build file:
ja_jp: それ以外の場合は、ビルドファイルに依存関係を手動で追加できます。

source: Otherwise, you can manually add this to the dependencies section of your build file:
ja_jp: そうでない場合は、 `pom.xml` ファイルの依存関係セクションに手動で追加することができます。

source: Otherwise, you must link:{hibernate-search-doc-prefix}#coordination-outbox-polling-schema[manually alter your schema to add the necessary tables/sequences].
ja_jp: そうでない場合は、 link:{hibernate-search-doc-prefix}#coordination-outbox-polling-schema[手動でスキーマを変更して、必要なテーブル/シーケンスを追加する]必要があります。

source: Otherwise, you must link:{hibernate-search-docs-url}#coordination-outbox-polling-schema[manually alter your schema to add the necessary tables/sequences].
ja_jp: そうでない場合は、link:{hibernate-search-docs-url}#coordination-outbox-polling-schema[手動でスキーマを変更して、必要なテーブル/シーケンスを追加する] 必要があります。

source: Otherwise, you must also update the browser script to set the `X-Requested-With` header with the `JavaScript` value and reload the last requested page in case of a `499` status code.
ja_jp: それ以外の場合は、ブラウザースクリプトを更新し、 `X-Requested-With` ヘッダーに `JavaScript` 値を設定して、 `499` ステータスコードの場合は最後にリクエストされたページを再度読み込みする必要があります。

source: Our CI/CD process was automated but not enough
ja_jp: CI/CDプロセスは自動化されていたが、十分ではなかった

source: Our Dev UI.
ja_jp: Dev UI

source: Our Dockerfile for native executables is now using `quay.io/quarkus/quarkus-micro-image:1.0` as the base image. This image is based on https://www.redhat.com/en/blog/introduction-ubi-micro[UBI Micro] and reduces the size of the native image.
ja_jp: ネイティブ実行可能ファイル用のDockerfileは、 `quay.io/quarkus/quarkus-micro-image:1.0` を使用するようになりました。このイメージは https://www.redhat.com/en/blog/introduction-ubi-micro[UBI Micro] をベースとしており、ネイティブイメージのサイズを縮小しています。

source: Our Gradle support has been upgraded to Gradle 8.
ja_jp: GradleのサポートがGradle 8にアップグレードされました。

source: Our Kotlin extensions got upgraded to Kotlin 1.7.
ja_jp: KotlinエクステンションがKotlin 1.7にアップグレードされました。

source: Our Kotlin story got some nice additions: the RESTEasy Reactive, REST Client and Reactive Messaging extensions now support coroutines.
ja_jp: RESTEasy Reactive、REST Client、Reactive Messagingの各エクステンションがコルーチンをサポートするようになり、Kotlinのストーリーにいくつかの素晴らしい追加要素が加わりました。

source: Our Micrometer support is continuously improving:
ja_jp: 当社のMicrometer対応は常に改善しています:

source: Our Quarkus data layer is now ready, so let's create the React GUI next.
ja_jp: Quarkusのデータレイヤーの準備ができたので、次はReactのGUIを作りましょう。

source: Our Spring friends told us that these sorts of adjustments would be completely standard. We still wanted to measure out of the box performance, so we settled on a compromise. We measured both out of the box, and a lightly tuned version. In the graphics we show on the front page, we're showing the tuned version. Here's the tuned equivalent of the out of the box results above, for the same code level and scripts:
ja_jp: 私たちのSpringの友人たちは、このような調整は完全に標準的なものだと教えてくれました。私たちは依然として初期設定のパフォーマンスを測定したいと考えていたため、妥協案に落ち着きました。初期設定バージョンと、軽くチューニングされたバージョンの両方を測定しました。フロントページに表示しているグラフィックでは、チューニングされたバージョンを表示しています。以下に、同じコードレベルとスクリプトを使用した、上記の初期設定の結果に相当するチューニング版を示します。

source: Our application contains a single class that handles the web sockets. Create the `org.acme.websockets.ChatSocket` class in the `src/main/java` directory. Copy the following content into the created file:
ja_jp: このアプリケーションには、websocketを処理するクラスが一つ含まれます。 `src/main/java` ディレクトリーに `org.acme.websockets.ChatSocket` クラスを作成します。作成したファイルに以下の内容をコピーします。

source: Our application contains a single class that handles the web sockets. Create the `org.acme.websockets.ChatWebSocket` class in the `src/main/java` directory. Copy the following content into the created file:
ja_jp: アプリケーションには、Web ソケットを処理する単一のクラスが含まれています。 `src/main/java` ディレクトリーに `org.acme.websockets.ChatWebSocket` クラスを作成します。 作成したファイルに次の内容をコピーします。

source: Our benchmarks reveal that the measurable performance with this new extension is almost identical to what we would achieve using Quarkus' Reactive Routes API (which is a very interesting API in its own right, but is generally more low level - not to mention the fact that it's a new API developers would need to learn).
ja_jp: ベンチマークでは、この新しいエクステンションを使った測定可能なパフォーマンスは、QuarkusのReactive Routes API(それ自体は非常に興味深いAPIですが、一般的には低レベルなものです)とほぼ同等です。

source: Our build process is already massively parallelized, but we identified a few areas where this was not the case, for example, the generation of Hibernate ORM proxies. We fixed that.
ja_jp: 私たちのビルドプロセスは既に大規模に並列化されていますが、Hibernate ORMプロキシの生成など、並列化されていなかったいくつかの領域を特定しました。私たちはそれを修正しました。

source: Our builds use https://vale.sh[Vale] to check grammar, style, and word usage in the English versions of our documents. We created our own Vale style ruleset to ensure that content aligns with the preferred Quarkus style guidelines.
ja_jp: 我々は link:https://vale.sh[Vale] を使用して、英語版ドキュメントの文法、スタイル、単語の使用状況をチェックしています。独自のValeスタイルルールセットを作成し、コンテンツがQuarkusの推奨スタイルガイドラインに沿うようにしました。

source: Our commitment is unchanged: give developers the best option for their workload and keep improving each path.
ja_jp: 私たちのコミットメントは変わっていません。開発者にそのワークロードに最適なオプションを提供し、各パスを改善し続けることです。

source: Our dependency injection solution is based on CDI. You can use JAX-RS annotations to define the REST endpoints. You can use JPA annotations to map your persistent entities and JTA annotations to declare the transaction boundaries. You can use Eclipse MicroProfile to configure and monitor your application. You can use Vert.x, Apache Camel and we support much more.
ja_jp: 当社の依存性注入ソリューションは CDI に基づいています。JAX-RS アノテーションを使用して REST エンドポイントを定義できます。JPA アノテーションを使用して永続エンティティーをマッピングし、JTA アノテーションを使用してトランザクション境界を宣言できます。Eclipse MicroProfile を使用して、アプリケーションを設定および監視できます。Vert.x、Apache Camel を使用でき、さらに多くの機能をサポートしています。

source: Our experiments seem to indicate that Quarkus with virtual threads will scale better than Quarkus blocking (offloading the computation on a pool of platform worker threads) but not as well as Quarkus reactive. The memory consumption especially might be an issue: if your system needs to keep its memory footprint low we would advise you stick to using reactive constructs.
ja_jp: 我々の実験は、仮想スレッドを使用したQuarkusは、Quarkus blocking（プラットフォームワーカスレッドのプールに計算をオフロードする）よりもスケーラビリティが高く、Quarkus reactiveほどにはスケーラビリティが高くないことを示しているようです。特にメモリ消費量が問題です。もし、システムがメモリフットプリントを低く抑える必要がある場合は、リアクティブの仕組みを使用することをお勧めします。

source: Our experiments so far show that when a virtual thread queries a database using the JDBC driver, it will pin its carrier thread during the entire operation.
ja_jp: これまでの実験から、仮想スレッドがJDBCドライバを使ってデータベースに問い合わせを行う操作をしている間、仮想スレッドがキャリアスレッドを拘束することが分かっています。

source: Our first entity
ja_jp: 最初のエンティティ

source: Our first order of business is to set up the model we will be using to define the `multipart/form-data` payload, in the form of a `MultipartBody` POJO.
ja_jp: まず最初に、 `multipart/form-data` のペイロードを定義するために使用するモデルを、 `MultipartBody` POJO の形で設定します。

source: Our first order of business is to setup the model we will be using to define the `multipart/form-data` payload, in the form of a `MultipartBody` POJO.
ja_jp: 最初の仕事は、 `multipart/form-data` ペイロードを定義するために使用するモデルを、 `MultipartBody` POJO の形でセットアップすることです。

source: Our first repository
ja_jp: 最初のリポジトリ

source: Our fourth semi-annually Q&A session is happening.
ja_jp: 半期に一度のQ&Aセッションも4回目を迎えました。

source: Our gRPC extension only generated code for the application classes. Starting with 2.7.1.Final, it also generates code from the dependencies.
ja_jp: 私たちの gRPC エクステンションは、アプリケーションクラスのコードのみを生成していました。2.7.1.Finalからは、依存関係からもコードを生成するようになりました。

source: Our goal is to measure the coverage for both `foo/runtime` and `bar/runtime`. How do we proceed? First, we need to apply some configuration to the parent project.
ja_jp: 私たちの目標は、`foo/runtime` と `bar/runtime` の両方のカバレッジを測定することです。どのように進めればよいでしょうか。まず、親プロジェクトにいくつかの設定を適用する必要があります。

source: Our goal was to integrate Project Leyden into Quarkus in a way that preserves what Quarkus does best, while also maximizing the benefits of Leyden.
ja_jp: 私たちの目標は、Quarkus の長所を維持しつつ、Leyden の利点を最大限に引き出す形で Project Leyden を Quarkus に統合することでした。

source: Our imaginary `acme` extension is experimental, so we include the extension status declaration in the header.
ja_jp: 架空の `acme` エクステンションは実験的なものであるため、ヘッダーにエクステンションステータスの宣言を含めます。

source: Our journey to faster builds
ja_jp: より高速なビルドへの道のり

source: Our monthly newsletters bring together articles, videos and perspectives from across the Quarkus community.
ja_jp: 月刊ニュースレターは、Quarkusコミュニティ全体からの記事、ビデオ、視点をまとめたものです。

source: Our program was not business critical in the sense that if it did not work, business would not stop. But it is the only mean to deploy all of our OpenShift microservices. And given the pace of internal developments, it is considered a critical piece in the value chain. _ocpdeploy_ is not evidently ultra sophisticated, and we only scratched the surface of what could be done with Quarkus, but yet it worked for us, showing that it can tackle many different use cases.
ja_jp: 私たちのプログラムは、それが動作しなければビジネスが止まらないという意味で、ビジネスクリティカルではありませんでした。しかし、OpenShiftのマイクロサービスをすべてデプロイするには、このプログラムしかありません。 _ocpdeploy_は明らかに超高度なものではなく、Quarkusでできることの表面をなぞっただけでしたが、それでも私たちのために動いてくれたので、さまざまなユースケースに取り組めることがわかりました。

source: Our relation to magic depends on our background and experience. Quarkus lets you decide how much magic you accept. This post presented fours configurations, going from almost no magic to the _regular_ Quarkus code. Each approach has pros and cons:
ja_jp: 私たちのマジックとの関係は、私たちのバックグラウンドや経験によって異なります。Quarkusでは、どの程度のマジックを受け入れるかを決めることができます。この記事では、ほとんど魔法を使わない状態から _通常の_ Quarkusコードまで、4つの設定を紹介しました。それぞれのアプローチには長所と短所があります:

source: Our roadmap for the rest of the year:
ja_jp: 今年の残りのロードマップ:

source: Our solution to the Netty problem
ja_jp: Nettyの問題に対する我々の解決策

source: Our suggestion is to use the real database you intend to use in production; container technologies made this simple enough so you no longer have an excuse. Still, there are sometimes good reasons to also want the ability to run quick integration tests using the JVM powered databases, so this is possible as well.
ja_jp: 本番で使用する予定の実際のデータベースを使用することを提案します。コンテナーテクノロジーによりこれが容易になりました。依然として、JVM を搭載したデータベースを使用して迅速な統合テストを実行する機能が必要な場合もあります。そのような場合でも、これが可能です。

source: Our take is that Project Leyden offers a compelling balance between performance and compatibility, at a very reasonable cost, and could become part of the default deployment workflow for many Java applications running on the JVM.
ja_jp: 私たちの見解では、Project Leyden はパフォーマンスと互換性の魅力的なバランスを非常に合理的なコストで提供し、JVM 上で実行される多くの Java アプリケーションのデフォルトのデプロイメントワークフローの一部となる可能性があります。

source: Our vision extends to embracing new networking and security standards to meet the demands of the most critical deployments:
ja_jp: 私たちのビジョンは、最も重要なデプロイメントの要求を満たすために、新しいネットワーキングおよびセキュリティ標準を採用することにまで及びます。

source: Out of the box the OpenShift extension is configured to use xref:container-image.adoc#s2i[container-image-s2i]. However, it's still possible to use other container image extensions like:
ja_jp: OpenShift エクステンションは、初期設定では link:container-image.html#s2i[container-image-s2i] を使用するように設定されています。しかし、次のような他のコンテナイメージエクステンションを使用することも可能です:

source: Out of the box the extension will generate a `DeploymentConfig` resource. Often users, prefer to use `Deployment` as the main deployment resource, but still make use of OpenShift specific resources like `Route`, `BuildConfig` etc. This feature is enabled by setting `quarkus.openshift.deployment-kind` to `Deployment`.
ja_jp: このエクステンションは、デフォルトで `DeploymentConfig` リソースを生成します。多くのユーザーは、メインのデプロイメントリソースとして `Deployment` を使用しながらも、 `Route` 、 `BuildConfig` などの Openshift 固有のリソースを利用したいと考えています。この機能は、 `quarkus.openshift.deployment-kind` を `Deployment` に設定することで有効になります。
